---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseC
source: html/6ad23c15-d9f4-f663-21ea-d9a2e6be6385.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseC Property

The ApparentLoadPhaseC value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentLoadPhaseC { get; }
```

## Remarks
This property is used to retrieve the ApparentLoadPhaseC value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!